# vsoWidgetGetText

## Description
```pascal
FUNCTION vsoWidgetGetText(widgetID : LONGINT) : STRING;
```

```python

def vs.vsoWidgetGetText(widgetID):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events